// -----1.
/* Запросите у пользователя его имя. Выведите в окошке (с помощью функции alert) 
фразу: Привет, Николай! (вместо Николай должно показываться имя, которое ввел 
пользователь)*/

/*let user = prompt('Как вас зовут?');
alert("Привет " + user);
console.log(user); */

// ----2.
/*Запросите у пользователя число. Затем запросите степень, в которую нужно возвести 
это число. Выведите в консоль результат.*/

/*let num = prompt('Введите любое число');
let grade = prompt('В какую степень возвести это число?');
console.log(num ** grade); */

// ----4.
/*Создать произвольную переменную, присвоить ей произвольное строковое значение 
(например, "my text"). C помощью if написать условие: если значение переменной равно 
“some text”, присвоить ей значение “another text”, иначе - “some text”. */

/*let text = "my text";
if(text === "some text"){
    console.log("another text");    
} else(
    console.log("some text")
);*/

// -----5
/*Создать переменную и присвоить ей число.
Записать условие:
- если переменная равна нулю, присвоить ей 1;
- если меньше нуля - строку “less then zero”;
- если больше нуля - используя оператор “присвоение”, переменную умножить 
на 10 (использовать краткую запись). */

/*let num2 = -3;
if(num2 === 0){
    num2 = 1;
    console.log('равен нулю');    
} else if(num2 < 0){
    num2 = 'less then zero';
    console.log('меньше нуля');    
} else if(num2 > 0){
    num2 *= 10;
    console.log('больше нуля');    
}; */

// -----6.
/*Запросите у пользователя число и запишите его в переменную. 
(Не забывайте, что от пользователя мы всегда получаем строку).
Создайте переменную-результат и присвойте ей значение: если введенное 
пользователем число меньше 5, то результат будет '0', если больше -  '1'. 
Выведите результат в консоль. */

/*let num3 = +prompt('Введите число');
if(num3 < 5){
    number = 0;    
} else {
    number = '1';
};
console.log(number); */

// ------7.
/*Попросить пользователя ввести одно число, следом - второе число. 
Вывести в консоль максимальное из чисел (наибольшее) с текстом: 
Большее число: 7 (вместо 7 будет максимальное число из введенных пользователем).
* предусмотреть вариант ввода одинаковых чисел */

// let num4 = prompt('Введите число');
//     num5 = prompt('Введите число');
// if(num4 > num5){
//     console.log('Большее число: ' + num4);    
// } else if(num4 < num5){
//     console.log('Большее число: ' + num5)
// } else{
//     console.log('Числа равны');    
// };

// ------8
/*Определить, является ли введенное пользователем число num1 кратным введенному 
числу num2. Обе переменные запрашиваем у пользователя, ответ выводим в консоль. */

/**let num1 = +prompt('Введите число');
let num2 = +prompt('Введите число');
console.log(num1 % num2); */

// ------9
/**Запросить у пользователя средний балл, записать в переменную.
Если средний балл 1-4 - вывести в консоль "Двоечник, иди учись!", 
если 5-8 - "Неплохо, но давай еще поднажмем!", 
если 9-10 - "Ого, да ты настоящий отличник!" (можно другие фразы - по желанию). */

/* let score = +prompt('Введите средний бал');
if(score === 1 || score === 2 || score === 3 || score === 4){
    console.log("Двоечник, иди учись!");    
} else if(score === 5 || score === 6 || score === 7 || score === 8){
    console.log("Неплохо, но давай еще поднажмем!");
} else if(score === 9 || score === 10){
    console.log("Ого, да ты настоящий отличник!");
}; */

// -----10
/*Запросить у пользователя ответы на 2 вопроса:
- балл за экзамен (от 0 до 100)
- количество выполненных проектов (от 0 и больше)
Вывести в консоль общий выпускной балл в соответствии с этими значениями:
- 100, если балл за экзамен более 90 или количество проектов более 10.
- 90, если балл за экзамен более 75 и количество проектов не менее 5.
- 75, если балл за экзамен более 50 и количество проектов не менее 2.
- 0 во всех других случаях. */

/* let point = +prompt('Введите балл за экзамен (от 0 до 100):');
let project = +prompt('Введите количество выполненных проектов (от 0 и больше):');

if (point > 90 || project > 10) {
    console.log(100);
} else if (point > 75 && project >= 5) {
    console.log(90);
} else if (point > 50 && project >= 2) {
    console.log(75);
} else {
    console.log(0);
}; */

// ------11
/*День аренды автомобиля стоит $40. При аренде на 7 или больше дней вы получаете 
общую итоговую скидку $50. Если вы арендуете авто на 3 или более дней, ваша общая 
скидка составит $20.
Количество дней, на которые нужно арендовать авто, запрашиваются с помощью prompt. 
Напишите программу, рассчитывающую общую стоимость аренды на запрашиваемое 
количество дней. */

/*const costRentOfDay = 40;
let amountDay = +prompt('Количество дней, на которые нужно арендовать авто');

if(amountDay >= 7){
    console.log((amountDay * costRentOfDay) - 50);    
} else if(amountDay >= 3){
    console.log((amountDay * costRentOfDay) - 20);    
}; */
